microsoft/uf2-samdx1/lib/samd21/Atmel.SAMD21_DFP.pdsc
      <condition id="ATSAMD21G15A">
         <require Dvendor="Atmel:3" Dname="ATSAMD21G15A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21G15B">
         <require Dvendor="Atmel:3" Dname="ATSAMD21G15B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21E16L">
         <require Dvendor="Atmel:3" Dname="ATSAMD21E16L"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21G15L">
         <require Dvendor="Atmel:3" Dname="ATSAMD21G15L"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21E16B">
         <require Dvendor="Atmel:3" Dname="ATSAMD21E16B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21E16A">
         <require Dvendor="Atmel:3" Dname="ATSAMD21E16A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21E16BU">
         <require Dvendor="Atmel:3" Dname="ATSAMD21E16BU"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21J15B">
         <require Dvendor="Atmel:3" Dname="ATSAMD21J15B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21J15A">
         <require Dvendor="Atmel:3" Dname="ATSAMD21J15A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21G18A">
         <require Dvendor="Atmel:3" Dname="ATSAMD21G18A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21G17AU">
         <require Dvendor="Atmel:3" Dname="ATSAMD21G17AU"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21J17A">
         <require Dvendor="Atmel:3" Dname="ATSAMD21J17A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21E15CU">
         <require Dvendor="Atmel:3" Dname="ATSAMD21E15CU"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21E15B">
         <require Dvendor="Atmel:3" Dname="ATSAMD21E15B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21E15A">
         <require Dvendor="Atmel:3" Dname="ATSAMD21E15A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21E17A">
         <require Dvendor="Atmel:3" Dname="ATSAMD21E17A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21E15L">
         <require Dvendor="Atmel:3" Dname="ATSAMD21E15L"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21G16L">
         <require Dvendor="Atmel:3" Dname="ATSAMD21G16L"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21E16CU">
         <require Dvendor="Atmel:3" Dname="ATSAMD21E16CU"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21G16A">
         <require Dvendor="Atmel:3" Dname="ATSAMD21G16A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21G16B">
         <require Dvendor="Atmel:3" Dname="ATSAMD21G16B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21J16B">
         <require Dvendor="Atmel:3" Dname="ATSAMD21J16B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21G18AU">
         <require Dvendor="Atmel:3" Dname="ATSAMD21G18AU"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21J16A">
         <require Dvendor="Atmel:3" Dname="ATSAMD21J16A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21E18A">
         <require Dvendor="Atmel:3" Dname="ATSAMD21E18A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD21J18A">
         <require Dvendor="Atmel:3" Dname="ATSAMD21J18A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="ATSAMD21E15BU">
         <description>Headers and startup code for Atmel ATSAMD21E15BU</description>
         <files>
            <file condition="C" category="include" name="samd21b/include"/>
            <file condition="C" category="header" name="samd21b/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21b/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21b/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21b/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21b/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21b/gcc/system_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21b/gcc/gcc/startup_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samd21b/gcc/gcc/samd21e15bu_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samd21b/gcc/gcc/samd21e15bu_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21b/armcc/Device/SAMD21/Source/ARM/startup_SAMD21.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21b/armcc/Device/SAMD21/Source/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21b/iar/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21b/iar/iar/startup_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samd21b/iar/iar/samd21e15bu_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samd21b/iar/iar/samd21e15bu_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="ATSAMD21G17A">
         <description>Headers and startup code for Atmel ATSAMD21G17A</description>
         <files>
            <file condition="C" category="include" name="samd21a/include"/>
            <file condition="C" category="header" name="samd21a/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21a/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21a/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21a/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21a/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21a/gcc/system_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21a/gcc/gcc/startup_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samd21a/gcc/gcc/samd21g17a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samd21a/gcc/gcc/samd21g17a_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21a/armcc/Device/SAMD21/Source/ARM/startup_SAMD21.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21a/armcc/Device/SAMD21/Source/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21a/iar/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21a/iar/iar/startup_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samd21a/iar/iar/samd21g17a_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samd21a/iar/iar/samd21g17a_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="ATSAMD21G15A">
         <description>Headers and startup code for Atmel ATSAMD21G15A</description>
         <files>
            <file condition="C" category="include" name="samd21a/include"/>
            <file condition="C" category="header" name="samd21a/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21a/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21a/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21a/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21a/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21a/gcc/system_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21a/gcc/gcc/startup_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samd21a/gcc/gcc/samd21g15a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samd21a/gcc/gcc/samd21g15a_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21a/armcc/Device/SAMD21/Source/ARM/startup_SAMD21.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21a/armcc/Device/SAMD21/Source/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21a/iar/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21a/iar/iar/startup_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samd21a/iar/iar/samd21g15a_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samd21a/iar/iar/samd21g15a_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="ATSAMD21G15B">
         <description>Headers and startup code for Atmel ATSAMD21G15B</description>
         <files>
            <file condition="C" category="include" name="samd21c/include"/>
            <file condition="C" category="header" name="samd21c/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21c/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21c/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21c/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21c/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21c/gcc/system_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21c/gcc/gcc/startup_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samd21c/gcc/gcc/samd21g15b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samd21c/gcc/gcc/samd21g15b_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21c/armcc/Device/SAMD21/Source/ARM/startup_SAMD21.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21c/armcc/Device/SAMD21/Source/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21c/iar/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21c/iar/iar/startup_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samd21c/iar/iar/samd21g15b_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samd21c/iar/iar/samd21g15b_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="ATSAMD21E16L">
         <description>Headers and startup code for Atmel ATSAMD21E16L</description>
         <files>
            <file condition="C" category="include" name="samd21c/include"/>
            <file condition="C" category="header" name="samd21c/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21c/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21c/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21c/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21c/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21c/gcc/system_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21c/gcc/gcc/startup_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samd21c/gcc/gcc/samd21e16l_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samd21c/gcc/gcc/samd21e16l_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21c/iar/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21c/iar/iar/startup_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samd21c/iar/iar/samd21e16l_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samd21c/iar/iar/samd21e16l_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="ATSAMD21G15L">
         <description>Headers and startup code for Atmel ATSAMD21G15L</description>
         <files>
            <file condition="C" category="include" name="samd21c/include"/>
            <file condition="C" category="header" name="samd21c/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21c/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21c/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21c/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21c/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21c/gcc/system_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21c/gcc/gcc/startup_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samd21c/gcc/gcc/samd21g15l_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samd21c/gcc/gcc/samd21g15l_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21c/iar/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21c/iar/iar/startup_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samd21c/iar/iar/samd21g15l_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samd21c/iar/iar/samd21g15l_sram.icf"
                  attr="config"/>
         </files>
      </component>
