microsoft/uf2-samdx1/lib/samd21/Atmel.SAMD21_DFP.pdsc
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="ATSAMD21E16B">
         <description>Headers and startup code for Atmel ATSAMD21E16B</description>
         <files>
            <file condition="C" category="include" name="samd21c/include"/>
            <file condition="C" category="header" name="samd21c/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21c/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21c/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21c/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21c/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21c/gcc/system_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21c/gcc/gcc/startup_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samd21c/gcc/gcc/samd21e16b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samd21c/gcc/gcc/samd21e16b_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21c/armcc/Device/SAMD21/Source/ARM/startup_SAMD21.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21c/armcc/Device/SAMD21/Source/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21c/iar/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21c/iar/iar/startup_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samd21c/iar/iar/samd21e16b_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samd21c/iar/iar/samd21e16b_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="ATSAMD21E16A">
         <description>Headers and startup code for Atmel ATSAMD21E16A</description>
         <files>
            <file condition="C" category="include" name="samd21a/include"/>
            <file condition="C" category="header" name="samd21a/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21a/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21a/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21a/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21a/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21a/gcc/system_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21a/gcc/gcc/startup_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samd21a/gcc/gcc/samd21e16a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samd21a/gcc/gcc/samd21e16a_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21a/armcc/Device/SAMD21/Source/ARM/startup_SAMD21.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21a/armcc/Device/SAMD21/Source/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21a/iar/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21a/iar/iar/startup_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samd21a/iar/iar/samd21e16a_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samd21a/iar/iar/samd21e16a_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="ATSAMD21E16BU">
         <description>Headers and startup code for Atmel ATSAMD21E16BU</description>
         <files>
            <file condition="C" category="include" name="samd21b/include"/>
            <file condition="C" category="header" name="samd21b/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21b/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21b/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21b/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21b/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21b/gcc/system_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21b/gcc/gcc/startup_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samd21b/gcc/gcc/samd21e16bu_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samd21b/gcc/gcc/samd21e16bu_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21b/armcc/Device/SAMD21/Source/ARM/startup_SAMD21.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21b/armcc/Device/SAMD21/Source/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21b/iar/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21b/iar/iar/startup_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samd21b/iar/iar/samd21e16bu_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samd21b/iar/iar/samd21e16bu_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="ATSAMD21J15B">
         <description>Headers and startup code for Atmel ATSAMD21J15B</description>
         <files>
            <file condition="C" category="include" name="samd21c/include"/>
            <file condition="C" category="header" name="samd21c/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21c/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21c/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21c/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21c/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21c/gcc/system_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21c/gcc/gcc/startup_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samd21c/gcc/gcc/samd21j15b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samd21c/gcc/gcc/samd21j15b_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21c/armcc/Device/SAMD21/Source/ARM/startup_SAMD21.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21c/armcc/Device/SAMD21/Source/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21c/iar/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21c/iar/iar/startup_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samd21c/iar/iar/samd21j15b_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samd21c/iar/iar/samd21j15b_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="ATSAMD21J15A">
         <description>Headers and startup code for Atmel ATSAMD21J15A</description>
         <files>
            <file condition="C" category="include" name="samd21a/include"/>
            <file condition="C" category="header" name="samd21a/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21a/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21a/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21a/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21a/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21a/gcc/system_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21a/gcc/gcc/startup_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samd21a/gcc/gcc/samd21j15a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samd21a/gcc/gcc/samd21j15a_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21a/armcc/Device/SAMD21/Source/ARM/startup_SAMD21.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21a/armcc/Device/SAMD21/Source/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21a/iar/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21a/iar/iar/startup_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samd21a/iar/iar/samd21j15a_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samd21a/iar/iar/samd21j15a_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="ATSAMD21G18A">
         <description>Headers and startup code for Atmel ATSAMD21G18A</description>
         <files>
            <file condition="C" category="include" name="samd21a/include"/>
            <file condition="C" category="header" name="samd21a/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21a/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21a/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21a/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21a/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21a/gcc/system_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21a/gcc/gcc/startup_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samd21a/gcc/gcc/samd21g18a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samd21a/gcc/gcc/samd21g18a_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21a/armcc/Device/SAMD21/Source/ARM/startup_SAMD21.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21a/armcc/Device/SAMD21/Source/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21a/iar/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21a/iar/iar/startup_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samd21a/iar/iar/samd21g18a_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samd21a/iar/iar/samd21g18a_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="ATSAMD21G17AU">
         <description>Headers and startup code for Atmel ATSAMD21G17AU</description>
         <files>
            <file condition="C" category="include" name="samd21a/include"/>
            <file condition="C" category="header" name="samd21a/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21a/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21a/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21a/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21a/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21a/gcc/system_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21a/gcc/gcc/startup_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samd21a/gcc/gcc/samd21g17au_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samd21a/gcc/gcc/samd21g17au_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21a/armcc/Device/SAMD21/Source/ARM/startup_SAMD21.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21a/armcc/Device/SAMD21/Source/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21a/iar/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21a/iar/iar/startup_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samd21a/iar/iar/samd21g17au_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samd21a/iar/iar/samd21g17au_sram.icf"
                  attr="config"/>
         </files>
      </component>
