microsoft/uf2-samdx1/lib/samd21/Atmel.SAMD21_DFP.pdsc
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="ATSAMD21G16A">
         <description>Headers and startup code for Atmel ATSAMD21G16A</description>
         <files>
            <file condition="C" category="include" name="samd21a/include"/>
            <file condition="C" category="header" name="samd21a/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21a/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21a/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21a/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21a/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21a/gcc/system_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21a/gcc/gcc/startup_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samd21a/gcc/gcc/samd21g16a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samd21a/gcc/gcc/samd21g16a_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21a/armcc/Device/SAMD21/Source/ARM/startup_SAMD21.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21a/armcc/Device/SAMD21/Source/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21a/iar/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21a/iar/iar/startup_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samd21a/iar/iar/samd21g16a_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samd21a/iar/iar/samd21g16a_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="ATSAMD21G16B">
         <description>Headers and startup code for Atmel ATSAMD21G16B</description>
         <files>
            <file condition="C" category="include" name="samd21c/include"/>
            <file condition="C" category="header" name="samd21c/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21c/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21c/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21c/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21c/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21c/gcc/system_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21c/gcc/gcc/startup_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samd21c/gcc/gcc/samd21g16b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samd21c/gcc/gcc/samd21g16b_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21c/armcc/Device/SAMD21/Source/ARM/startup_SAMD21.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21c/armcc/Device/SAMD21/Source/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21c/iar/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21c/iar/iar/startup_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samd21c/iar/iar/samd21g16b_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samd21c/iar/iar/samd21g16b_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="ATSAMD21J16B">
         <description>Headers and startup code for Atmel ATSAMD21J16B</description>
         <files>
            <file condition="C" category="include" name="samd21c/include"/>
            <file condition="C" category="header" name="samd21c/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21c/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21c/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21c/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21c/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21c/gcc/system_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21c/gcc/gcc/startup_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samd21c/gcc/gcc/samd21j16b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samd21c/gcc/gcc/samd21j16b_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21c/armcc/Device/SAMD21/Source/ARM/startup_SAMD21.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21c/armcc/Device/SAMD21/Source/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21c/iar/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21c/iar/iar/startup_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samd21c/iar/iar/samd21j16b_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samd21c/iar/iar/samd21j16b_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="ATSAMD21G18AU">
         <description>Headers and startup code for Atmel ATSAMD21G18AU</description>
         <files>
            <file condition="C" category="include" name="samd21a/include"/>
            <file condition="C" category="header" name="samd21a/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21a/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21a/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21a/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21a/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21a/gcc/system_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21a/gcc/gcc/startup_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samd21a/gcc/gcc/samd21g18au_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samd21a/gcc/gcc/samd21g18au_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21a/armcc/Device/SAMD21/Source/ARM/startup_SAMD21.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21a/armcc/Device/SAMD21/Source/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21a/iar/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21a/iar/iar/startup_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samd21a/iar/iar/samd21g18au_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samd21a/iar/iar/samd21g18au_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="ATSAMD21J16A">
         <description>Headers and startup code for Atmel ATSAMD21J16A</description>
         <files>
            <file condition="C" category="include" name="samd21a/include"/>
            <file condition="C" category="header" name="samd21a/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21a/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21a/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21a/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21a/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21a/gcc/system_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21a/gcc/gcc/startup_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samd21a/gcc/gcc/samd21j16a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samd21a/gcc/gcc/samd21j16a_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21a/armcc/Device/SAMD21/Source/ARM/startup_SAMD21.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21a/armcc/Device/SAMD21/Source/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21a/iar/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21a/iar/iar/startup_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samd21a/iar/iar/samd21j16a_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samd21a/iar/iar/samd21j16a_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="ATSAMD21E18A">
         <description>Headers and startup code for Atmel ATSAMD21E18A</description>
         <files>
            <file condition="C" category="include" name="samd21a/include"/>
            <file condition="C" category="header" name="samd21a/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21a/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21a/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21a/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21a/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21a/gcc/system_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21a/gcc/gcc/startup_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samd21a/gcc/gcc/samd21e18a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samd21a/gcc/gcc/samd21e18a_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21a/armcc/Device/SAMD21/Source/ARM/startup_SAMD21.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21a/armcc/Device/SAMD21/Source/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21a/iar/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21a/iar/iar/startup_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samd21a/iar/iar/samd21e18a_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samd21a/iar/iar/samd21e18a_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="ATSAMD21J18A">
         <description>Headers and startup code for Atmel ATSAMD21J18A</description>
         <files>
            <file condition="C" category="include" name="samd21a/include"/>
            <file condition="C" category="header" name="samd21a/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21a/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samd21a/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21a/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samd21a/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21a/gcc/system_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samd21a/gcc/gcc/startup_samd21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samd21a/gcc/gcc/samd21j18a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samd21a/gcc/gcc/samd21j18a_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21a/armcc/Device/SAMD21/Source/ARM/startup_SAMD21.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samd21a/armcc/Device/SAMD21/Source/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21a/iar/system_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samd21a/iar/iar/startup_samd21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samd21a/iar/iar/samd21j18a_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samd21a/iar/iar/samd21j18a_sram.icf"
                  attr="config"/>
         </files>
      </component>
   </components>
</package>
